app/controllers/books_controller.rb

  def create
    begin
      @book = Book.new(book_params)
      @book.save!
---
INSERT INTO "books" ("title", "publisher", "date_published", "created_at", "updated_at", "author_id") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Rama 2"], ["publisher", nil], ["date_published", nil], ["created_at", "2022-05-03 03:53:39.439601"], ["updated_at", "2022-05-03 03:53:39.439601"], ["author_id", 29]]

  def update
    begin
      @book.update!(book_params)
---
UPDATE "books" SET "updated_at" = ? WHERE "books"."id" = ?  [["updated_at", "2022-05-10 09:38:23.451483"], ["id", 6]]

  def destroy
    # The first line will ensure the upload image on Cloudinary is destroyed when a book is destroyed
    @book.cover.purge
    @book.destroy
---
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 7]]

  def set_authors
    @authors = Author.order(:last_name)
---
SELECT "authors".* FROM "authors" ORDER BY "authors"."last_name" ASC